Repository: OmegaT-L10N/ca
Catalog: omegat/project_save.tmx
Source language: en
Languages: ca

source: There are two possibilities to run an SVN server: you can install SVN on your own server or you can use a hosted service.
ca: Hi ha dues possibilitats per executar un servidor SVN: pot instal·lar SVN en el seu propi servidor o pot utilitzar un servei d'allotjament.

source: They also improve glossary matching.
ca: Milloren, a més, les coincidències amb el glossari.

source: They can share common material, like project translation memory and its glossary
ca: Poden compartir material comú, com memòries de traducció per al projecte i els seus glossaris.

source: This is also the place to add members of the team to the project and assign them their rights.
ca: Aquí també s'afegiran al projecte els membres de l'equip i se'ls associaran els seus drets.

source: This is especially useful in case of languages that use pre- and postfix forms for the stem words.
ca: Aquest ús és especialment útil en el cas de les llengües que utilitzen prefixos i sufixos que s'uneixen a les paraules mare.

source: This will actually do a checkout of the project in a local folder.
ca: Esta acció, en realitat, baixarà el projecte en una carpeta local.

source: To access the private part, a user must create a key using https://demo.taas-project.eu/account/keys/create?system=omegaT.
ca: Per accedir a la part privada, l'usuari ha de crear una clau utilitzant https://demo.taas-project.eu/account/keys/create?system=omegaT.

source: To avoid any problems, one person only should have these rights at least initially.
ca: Per evitar qualsevol problema, una persona només tindrà aquests drets, almenys inicialment.

source: To limit the amount of data, it is possible to select a specific domain by selecting Select TaaS Terminology Lookup Domain.
ca: Per limitar la quantitat de dades, és possible seleccionar un domini específic seleccionant Select TaaS Terminology Lookup Domain .

source: To update the local files, right-click on the checkout folder and select SVN Update.
ca: Per actualitzar els arxius locals, feu clic a la carpeta checkout i seleccioneu SVN Update.

source: Tokenizers (or stemmers) improve the quality of matches by recognizing inflected words in source and translation memory data.
ca: Els tokenizers (o lematitzadors) milloren la qualitat de les coincidències mitjançant el reconeixement de paraules flexionades en les dades del text original i les memòries de traducció.

source: Tokenizers are included in OmegaT and active by default.
ca: Els tokenizers s'inclouen en OmegaT i s'activen per defecte.

source: Type the name and description of the repository.
ca: Escriviu el nom i la descripció del repositori.

source: Under Linux, if OmegaT is still asking for your credentials, you can checking the Force saving password as plain text checkbox.
ca: A Linux, si OmegaT encara demana les vostres credencials, comproveu la casella de selecció Force saving password as plain text

source: Using the team project in OmegaT
ca: Utilització del projecte en equip en OmegaT

source: Version control - introduction
ca: Control de Versió - Introducció

source: Very popular clients for Windows environment are TortoiseSVN and TortoiseGit.
ca: Alguns dels clients més populars per a l'entorn Windows són TortoiseSVN i TortoiseGit.

source: When accessing the service without a private key, the following message will be put in the log: TaaS API key not found.
ca: Si s'accedeix al servei sense una clau privada, el següent missatge apareixerà en el registre: TaaS API key not found (clau TaaS API no trobada).

source: When using an external service you must be aware of the possible implications in terms of confidentiality, since you are loading the original document on a server outside of your direct control.
ca: Quan utilitzeu un servei extern heu de ser conscient de les possibles conseqüències en termes de confidencialitat, ja que carregareu el document original a un servidor fora del vostre control directe.

source: Within a given language pair it is best to keep different subjects and/or clients as separate repositories as well.
ca: Dins d'un mateix parell de llengües, s'aconsella també mantenir les diferents matèries o clients en repositoris separats.

source: You create first an empty client folder on your disk.
ca: Primer creeu una carpeta de client buida en el disc.

source: You might want to apply the same to the target folder and its contents.
ca: És possible que vulgueu aplicar la mateixa operació a la carpeta target (destinació) i al seu contingut.

source: lep, lepa, lepo - singular, masculine, feminine, neutral
ca: lep, lepa, lepo - singular, masculí, femení, neutre

source: najlepših - superlative, plural, genitive for M,F,N
ca: najlepših - superlatiu, plural, genitiu per a masculí, femení i neutre.

source: the contents of the source folder
ca: Els continguts de la carpeta source (font)

source: the omegat project file - omegat.project
ca: La carpeta del projecte omegat - omegat.project

source: the project-specific filters definition - omegat\filters.xml
ca: La definició dels filtres específics del projecte - omegat\filters.xml

source: the translation memory - omegat\project_save.tmx
ca: La memòria de traducció - omegat\project_save.tmx

source: window, similar to the one below will appear:
ca: Una finestra similar a la de baix apareixerà:
